Tutoriels/interIsoFoam/batteurPiston/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    leftwall
    {
        type            uniformFixedValue;
        uniformValue    tableFile;
        file            "mouvementBatteur.dat";
        outOfBounds     clamp;
    }

    "(back|front)"
    {
        type            empty;
    }

    "(rightwall|rightInterface|leftInterface)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    "(bottom1|bottom2|top)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
